<a href="https://colab.research.google.com/github/kariukidan/Sigma_academy/blob/main/Copy_of_2904_Practice_class_JOIN_Methods.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3
import pandas as pd

# Connect to the SQLite database
conn = sqlite3.connect('sample.db')
cursor = conn.cursor()

# Create tables
conn.execute('''CREATE TABLE IF NOT EXISTS Students (
                student_id INTEGER PRIMARY KEY,
                name TEXT,
                age INTEGER)''')

conn.execute('''CREATE TABLE IF NOT EXISTS courses (
                course_id INTEGER PRIMARY KEY,
                course_name TEXT)''')

conn.execute('''CREATE TABLE IF NOT EXISTS grades (
                student_id INTEGER,
                course_id INTEGER,
                grade TEXT,
                FOREIGN KEY(student_id) REFERENCES students(student_id),
                FOREIGN KEY(course_id) REFERENCES courses(course_id))''')

In [ ]:
# Sample data for students, courses, and grades
students_data = [(1, 'Alice', 20),
                 (2, 'Bob', 21),
                 (3, 'Charlie', 19),
                 (4, 'David', 22),
                 (5, 'Eve', 20),
                 (6, 'Frank', 21),
                 (7, 'Grace', 19),
                 (8, 'Harry', 22),
                 (9, 'Ivy', 20),
                 (10, 'Jack', 21)]

courses_data = [(101, 'Math'),
                (102, 'Physics'),
                (103, 'Chemistry'),
                (104, 'Biology'),
                (105, 'History'),
                (106, 'Literature'),
                (107, 'Computer Science'),
                (108, 'Art')]


grades_data = [
               (3, 103, 'C'),
               (4, 104, 'A'),
               (5, 105, 'B'),
               (6, 106, 'C'),
               (7, 107, 'A'),
               (8, 108, 'B'),
               (9, 109, 'C'),
               (10, 110, 'A')]

# Insert sample data into tables
conn.executemany('INSERT INTO students VALUES (?, ?, ?)', students_data)
conn.executemany('INSERT INTO courses VALUES (?, ?)', courses_data)
conn.executemany('INSERT INTO grades VALUES (?, ?, ?)', grades_data)

In [ ]:
cursor = conn.cursor()

In [ ]:
cursor.execute("SELECT * from students ORDER By  student_id LIMIT 5")
cursor.fetchall()

[(1, 'Alice', 20),
 (2, 'Bob', 21),
 (3, 'Charlie', 19),
 (4, 'David', 22),
 (5, 'Eve', 20)]

In [ ]:
cursor.execute("SELECT * from students LIMIT 5")
cursor.fetchall()

[(1, 'Alice', 20),
 (2, 'Bob', 21),
 (3, 'Charlie', 19),
 (4, 'David', 22),
 (5, 'Eve', 20)]

In [ ]:
cursor.execute("SELECT * from students WHERE ROWID <= 5")
cursor.fetchall()

[(1, 'Alice', 20),
 (2, 'Bob', 21),
 (3, 'Charlie', 19),
 (4, 'David', 22),
 (5, 'Eve', 20)]

In [ ]:
cursor.execute("SELECT * from grades WHERE ROWID <= 5")
cursor.fetchall()

[(3, 103, 'C'), (4, 104, 'A'), (5, 105, 'B'), (6, 106, 'C'), (7, 107, 'A')]

In [ ]:
cursor.execute("SELECT * from courses WHERE ROWID <= 105")
cursor.fetchall()

[(101, 'Math'),
 (102, 'Physics'),
 (103, 'Chemistry'),
 (104, 'Biology'),
 (105, 'History')]

In [ ]:
# Examples of queries using JOIN operators
# INNER JOIN
inner_join_query = '''
SELECT students.name, courses.course_name, grades.grade
FROM students
INNER JOIN grades ON students.student_id = grades.student_id
INNER JOIN courses ON grades.course_id = courses.course_id
'''
cursor.execute(inner_join_query)

In [ ]:
results = cursor.fetchall()
for row in results:
  print(row)

('Charlie', 'Chemistry', 'C')
('David', 'Biology', 'A')
('Eve', 'History', 'B')
('Frank', 'Literature', 'C')
('Grace', 'Computer Science', 'A')
('Harry', 'Art', 'B')

In [ ]:
# LEFT JOIN
left_join_query = '''
SELECT students.name, courses.course_name, grades.grade
FROM students
LEFT JOIN grades ON students.student_id = grades.student_id
LEFT JOIN courses ON grades.course_id = courses.course_id
'''

cursor.execute(left_join_query)

In [ ]:
results = cursor.fetchall()
for row in results:
  print(row)

('Alice', None, None)
('Bob', None, None)
('Charlie', 'Chemistry', 'C')
('David', 'Biology', 'A')
('Eve', 'History', 'B')
('Frank', 'Literature', 'C')
('Grace', 'Computer Science', 'A')
('Harry', 'Art', 'B')
('Ivy', None, 'C')
('Jack', None, 'A')

In [ ]:
# RIGHT JOIN (Simulated using LEFT JOIN with switched tables)
right_join_query = '''
SELECT students.name, courses.course_name, grades.grade
FROM courses
LEFT JOIN grades ON courses.course_id = grades.course_id
LEFT JOIN students ON grades.student_id = students.student_id
'''
cursor.execute(right_join_query)

In [ ]:
results = cursor.fetchall()
for row in results:
  print(row)

(None, 'Math', None)
(None, 'Physics', None)
('Charlie', 'Chemistry', 'C')
('David', 'Biology', 'A')
('Eve', 'History', 'B')
('Frank', 'Literature', 'C')
('Grace', 'Computer Science', 'A')
('Harry', 'Art', 'B')

In [ ]:
#students with no mark
query = '''
SELECT students.name, students.age, students.student_id
FROM students
LEFT JOIN grades ON students.student_id = grades.student_id
WHERE grades.grade is NULL
'''
cursor.execute(query)

In [ ]:
results = cursor.fetchall()
for row in results:
  print(row)

('Alice', 20, 1)
('Bob', 21, 2)

In [ ]:
query = '''
SELECT courses.course_name
FROM courses
LEFT JOIN grades ON grades.course_id = courses.course_id
WHERE grades.student_id is NULL
'''
cursor.execute(query)
results = cursor.fetchall()
for row in results:
  print(row)

('Math',)
('Physics',)

In [ ]:
# FULL JOIN (Simulated using LEFT JOIN with union of LEFT and RIGHT JOIN)
full_join_query = '''
SELECT students.name, courses.course_name, grades.grade
FROM students
LEFT JOIN grades ON students.student_id = grades.student_id
LEFT JOIN courses ON grades.course_id = courses.course_id

UNION

SELECT students.name, courses.course_name, grades.grade
FROM courses
LEFT JOIN grades ON courses.course_id = grades.course_id
LEFT JOIN students ON grades.student_id = students.student_id
WHERE students.student_id IS NULL
'''

cursor.execute(full_join_query)

results = cursor.fetchall()
for row in results:
  print(row)

ProgrammingError: Cannot operate on a closed database.

In [ ]:
# FULL JOIN (Simulated using LEFT JOIN with union of LEFT and RIGHT JOIN)
full_join_query = '''
SELECT students.name, courses.course_name, grades.grade
FROM students
LEFT JOIN grades ON students.student_id = grades.student_id
LEFT JOIN courses ON grades.course_id = courses.course_id

UNION

SELECT students.name, courses.course_name, grades.grade
FROM courses
LEFT JOIN grades ON courses.course_id = grades.course_id
LEFT JOIN students ON grades.student_id = students.student_id
WHERE students.student_id IS NULL
'''

# Function to execute the query and output the result
def execute_query(query):
    cursor = conn.execute(query)
    columns = [description[0] for description in cursor.description]
    df = pd.DataFrame(cursor.fetchall(), columns=columns)
    return df

# Output query results
print("INNER JOIN:")
print(execute_query(inner_join_query))
print("\nLEFT JOIN:")
print(execute_query(left_join_query))
print("\nRIGHT JOIN:")
print(execute_query(right_join_query))
print("\nFULL JOIN:")
print(execute_query(full_join_query))

# Commit changes and close connection
conn.commit()
conn.close()

INNER JOIN:
      name       course_name grade
0  Charlie         Chemistry     C
1    David           Biology     A
2      Eve           History     B
3    Frank        Literature     C
4    Grace  Computer Science     A
5    Harry               Art     B

LEFT JOIN:
      name       course_name grade
0    Alice              None  None
1      Bob              None  None
2  Charlie         Chemistry     C
3    David           Biology     A
4      Eve           History     B
5    Frank        Literature     C
6    Grace  Computer Science     A
7    Harry               Art     B
8      Ivy              None     C
9     Jack              None     A

RIGHT JOIN:
      name       course_name grade
0     None              Math  None
1     None           Physics  None
2  Charlie         Chemistry     C
3    David           Biology     A
4      Eve           History     B
5    Frank        Literature     C
6    Grace  Computer Science     A
7    Harry               Art     B

FULL JOIN:
       name       course_name grade
0      None              Math  None
1      None           Physics  None
2     Alice              None  None
3       Bob              None  None
4   Charlie         Chemistry     C
5     David           Biology     A
6       Eve           History     B
7     Frank        Literature     C
8     Grace  Computer Science     A
9     Harry               Art     B
10      Ivy              None     C
11     Jack              None     A